// a+b 就是a^b +(a&b<<1),(不能出现+),只能就这样循环往复,直到(a‘’‘’&b'''')<<1为0，即进位信息为0

function add(a,b){
  let sum=a;
  while(b!=0){
    sum= a^b;//无进位相加信息 ->sum
    b =(a&b)<<1;// 进位信息 ->  b->b'(进位信息)
    a=sum;
  }
  return sum;
}

/** * 
 *    0101101 45 
 *  × 0001010 × 10 
 *  ----------- 
 *    0000000 
 * + 0101101 
 * + 0000000 
 * +0101101 
 * ----------- 
 *  111000010 = 450 
 */

function multi(a,b){ //比如a是0110，b是0101，
  let res=0;
  while(b!=0){
    if((b&1)!=0){ //0101和1与得到0001，010&1=0 01&1 =1
      res=add(res,a) //res和0001相加,上一次和011000相加
    }
    a<<=1; //然后a是01100,011000，0110000
    b>>>=1; //然后b是不带符号的右移一位得到010,010右移一位得倒01
  }
  return res;
}